erp3l/src/Enums/ТипыПлатежейПоАренде/ТипыПлатежейПоАренде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПлатежейПоАренде</name>
  <enumValues>
    <name>АрендныеОбязательства</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ДоговорыАренды/ДоговорыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАренды</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерДоговора</name>
    <type>
      <types>EnumRef.ХарактерыДоговоровФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Балансодержатель</name>
    <type>
      <types>EnumRef.БалансодержательПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОбеспечительныйПлатеж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВыкупПредметовАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАвансированиеВыкупнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияСтоимостиАктивов</name>
    <type>
      <types>EnumRef.СпособыОпределенияСтоимостиПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовУслуги</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовУслуги</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеУслуги</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовПроценты</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВерсияСоглашения</name>
    <comment>Версия соглашения, на основании которой заполнен элемент справочника ДоговорыКонтрагентов.</comment>
    <type>
      <types>DefinedType.ВерсияСоглашения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <comment>Вид договора по классификатору &quot;1С:Управление Холдингом&quot;</comment>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаФИ</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаФинансовыхИнструментовМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйДоговор</name>
    <comment>Рамочный договор (УХ)</comment>
    <type>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСоглашения</name>
    <comment>(УХ)</comment>
    <type>
      <types>EnumRef.ВидыСоглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАктуализацииЗаявок</name>
    <type>
      <types>EnumRef.РежимыАктуализацииЗаявокПоГрафикам</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовПроценты</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПроценты</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетПлатежа</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПорядокОплаты</name>
    <type>
      <types>EnumRef.УдалитьПорядокОплатыПоСоглашениям</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтавкаНДС2</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаАрендныеОбязательства</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаВыкупнаяСтоимость</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаОбеспечительныйПлатеж</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетУчетаУслугиПоЛизингу</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаВыкупаПредметаЛизинга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаОбеспечительногоПлатежа</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСуммаУслугПоЛизингу</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСрокМес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Котировка</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИерархииСправедливойСтоимости</name>
    <type>
      <types>EnumRef.УровеньИерархииСправедливойСтоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнойРасчетРезерваПоЗадолженности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассДоговора</name>
    <type>
      <types>CatalogRef.КлассыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СрочностьЗадолженности</name>
    <type>
      <types>EnumRef.СрочностьЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойЦФО</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизводственныеКалендари</name>
    <attributes>
      <name>ПроизводственныйКалендарь</name>
      <type>
        <types>CatalogRef.ПроизводственныеКалендари</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Enums/ТипыПлатежейПоАренде/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Договор") Тогда
		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.АрендныеОбязательства) КАК Ссылка,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыАренды КАК Т
	|ГДЕ
	|	Т.Ссылка = &Договор
	|	И НЕ &ЭтоПлатеж
	|	И НЕ &ВозвратПлатежа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.УслугаПоАренде) КАК Ссылка,
	|	2 КАК Порядок
	|ГДЕ
	|	НЕ &ВозвратПлатежа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ОбеспечительныйПлатеж),
	|	3 КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыАренды КАК Т
	|ГДЕ
	|	Т.Ссылка = &Договор
	|	И Т.ЕстьОбеспечительныйПлатеж
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ВыкупнаяСтоимость) КАК Ссылка,
	|	4 КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыАренды КАК Т
	|ГДЕ
	|	Т.Ссылка = &Договор
	|	И Т.ЕстьВыкупПредметовАренды
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.ВыкупнаяСтоимостьАванс) КАК Ссылка,
	|	5 КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыАренды КАК Т
	|ГДЕ
	|	Т.Ссылка = &Договор
	|	И Т.ЕстьАвансированиеВыкупнойСтоимости
	|	И НЕ &КорректировкаЗадолженности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.Проценты) КАК Ссылка,
	|	6 КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыАренды КАК Т
	|ГДЕ
	|	Т.Ссылка = &Договор
	|	И НЕ &ЭтоПлатеж
	|	И НЕ &ВозвратПлатежа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоАренде.НДС) КАК Ссылка,
	|	7 КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыАренды КАК Т
	|ГДЕ
	|	Т.Ссылка = &Договор
	|	И НЕ &ЭтоПлатеж
	|	И НЕ &ВозвратПлатежа
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("Договор", Параметры.Отбор.Договор);
	Если Параметры.Отбор.Свойство("Платеж") Тогда
		Запрос.УстановитьПараметр("ЭтоПлатеж", Параметры.Отбор.Платеж);
	Иначе
		Запрос.УстановитьПараметр("ЭтоПлатеж", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВозвратПлатежа",
		?(Параметры.Отбор.Свойство("ВозвратПлатежа"), Параметры.Отбор.ВозвратПлатежа, Ложь));
	
	Если Параметры.Свойство("КорректировкаЗадолженности") И Параметры.КорректировкаЗадолженности Тогда
		Запрос.УстановитьПараметр("КорректировкаЗадолженности", Истина);
	Иначе
		Запрос.УстановитьПараметр("КорректировкаЗадолженности", Ложь);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
